###############################################################################
# Created by write_sdc
###############################################################################
current_design sequence_detector_110
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1.0028 [get_ports {clk_i}]
set_input_delay 0.4000 -clock [get_clocks {core_clock}] -add_delay [get_ports {reset_i}]
set_input_delay 0.4000 -clock [get_clocks {core_clock}] -add_delay [get_ports {seq_in}]
set_output_delay 0.4000 -clock [get_clocks {core_clock}] -add_delay [get_ports {detect}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
